ejercicio 4/controllers/TemperaturasController.php

    protected function findModel($id)
    {
        if (($model = Temperaturas::findOne($id)) !== null) {
---
SELECT * FROM `temperaturas` WHERE `id`='1'